Environment: dev. Pipeline Stage: dev
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_private_dns_resolver.pdnsresolver will be created
  + resource "azurerm_private_dns_resolver" "pdnsresolver" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "pdnsresolver"
      + resource_group_name = "rg-xwc-dnsresolve-001"
      + virtual_network_id  = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001"
    }

  # azurerm_private_dns_resolver_inbound_endpoint.pdnsinendpoint will be created
  + resource "azurerm_private_dns_resolver_inbound_endpoint" "pdnsinendpoint" {
      + id                      = (known after apply)
      + location                = "uksouth"
      + name                    = "inbound-endpoint"
      + private_dns_resolver_id = (known after apply)
      + tags                    = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }

      + ip_configurations {
          + private_ip_address           = (known after apply)
          + private_ip_allocation_method = "Dynamic"
          + subnet_id                    = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-dnsresolve"
        }
    }

  # azurerm_private_dns_txt_record.offlineprint will be created
  + resource "azurerm_private_dns_txt_record" "offlineprint" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "offlinemode"
      + resource_group_name = "rg-xwc-dnsresolve-001"
      + ttl                 = 300
      + zone_name           = "print.internal.xcp"

      + record {
          + value = "FALSE"
        }
    }

  # azurerm_private_dns_zone.xcp_int_zone will be created
  + resource "azurerm_private_dns_zone" "xcp_int_zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "print.internal.xcp"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-xwc-dnsresolve-001"
      + tags                                                  = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
    }

  # azurerm_resource_group.rg_dns_resolver will be created
  + resource "azurerm_resource_group" "rg_dns_resolver" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rg-xwc-dnsresolve-001"
      + tags     = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
    }

  # module.device-manager.azurerm_mssql_elasticpool.elastic_pool will be updated in-place
  ~ resource "azurerm_mssql_elasticpool" "elastic_pool" {
        id                             = "/subscriptions/779c236c-a27b-405d-b0b8-0bbb5f7b5c67/resourceGroups/rg-xwc-app-001/providers/Microsoft.Sql/servers/sqlxwcdmsrv001/elasticPools/xwc-dev-pool"
        name                           = "xwc-dev-pool"
        tags                           = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
        # (8 unchanged attributes hidden)

      ~ sku {
          ~ capacity = 50 -> 100
            name     = "StandardPool"
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.